package nowcoder.com;

/**
 * 	小A、小B、小C三人正组队参加现场赛。小A刚过了一道大模拟，伸出手想看看几点了，
 * 	却发现自己没有带表，队友也没有带，因为大家平时是用手机看的。小A发现现场有一个电子显示屏上面有时间。
	电子显示屏是一个7*100的点阵,当前时间为一个7*29的矩阵,在显示屏上左右滚动,详见样例
	数字0~9分别用7*6的矩阵表示如下
	
	遗憾的是，小A眼睛高度近视，需要你念出时间给他听...
	所以现在给你一个这样的点阵，输出当前时间。
	
									
	输入
	多组输入数据，第一行是数据组数T(T≤1440)。
	接下来是T组数据，每组数据是一个7*100的点阵。输入数据保证其中存在合法的7*29的点阵，详见样例。
	
	样例输入
	
	输出
	对每组数据输出一行答案，该行中输出“Case #k: result”(对应第k组数据，冒号后有空格),result为当前时间h:m。
	样例输出
	Case #1: 9:56
	Case #2: 12:37
	Case #3: 14:8
	
	时间限制
	C/C++语言：1000MS其它语言：3000MS	
	内存限制
	C/C++语言：65536KB其它语言：589824KB
 */

/**
 * @auther      zxwtry
 * @email       zxwtry@qq.com
 * @project     OJ
 * @package     nowcoder.com
 * @file        百度17_时钟.java
 * @type        百度17_时钟
 * @date        2016年11月30日 下午10:27:04
 * @details     
 */
public class 百度17_时钟 {
	public static void main(String[] args) {
		
	}
}
