package nowcoder.com;




/**

阿里九游开放平台近日上架了一款新的益智类游戏——成三棋。成三棋是我国非常古老的一个双人棋类游戏，其棋盘如下图所示：



成三棋的棋盘上有很多条线段，只能在线段交叉点上放入棋子。我们可以用坐标系来描述棋盘：



如果一条线段上的三个交叉点都被同一玩家的棋子占据的话，则称这条线段被该玩家 成三。现在，小红和小明两人在游戏平台上下棋，其中小红的棋子是黑色的。请你帮小红计算他成三的线段数。

样例对应的棋盘如下：



输入格式

输入第一行两个整数 n,m(3 \le n, m \le 9)n,m(3≤n,m≤9)，nn 表示小红的棋子数，mm 表示小明的棋子数。

接下来 nn 行输入小红的棋子坐标。

接下来 mm 行输入小明的棋子坐标。

输入保证坐标合法，并且棋子之间不重合。

输出格式

输出小红成三的线段数。

样例输入

6 3
-1 0
-2 0
-3 0
-1 -1
-1 1
1 0
0 2
0 3
2 2
样例输出

2

 */

/**
 * @author      zxwtry
 * @email       zxwtry@qq.com
 * @project     OJ
 * @package     nowcoder.com
 * @file        计蒜客_初赛_1_1.java
 * @type        计蒜客_初赛_1_1
 * @date        2017年5月20日 下午6:59:12
 * @details     AC
 */


import java.util.HashSet;
import java.util.Scanner;

public class 计蒜客_初赛_1_1 {}
